###################
#### flag 변수 ####
###################

# 깃발을 올리고 내리듯이 참과 거짓으로 무언가를 판단할 때 주로 사용한다.




# list_of_book = ['장화홍련전','가락국 신화','온달 설화','금오신화','이생규장전','만복자서포기','수성지','백호집','원생몽유록','홍길동전','장생전','도문대작','옥루몽','옥련몽']
# # rental_book = ['장생전','원생몽유록','이생규장전','장화홍련전','수성지','백호집','난중일기','홍길동전','만복자서포기']
# rental_book = ['장생전','위대한 개츠비', '원생몽유록','이생규장전', '데미안', '장화홍련전','수성지','백호집','난중일기','홍길동전','만복자서포기']


# for rental in rental_book:
#     found = False   # flag 변수
#     for book in list_of_book:
#         if rental == book:
#             found = True
#             break
#     # 1. 모든 반복후 종료, 2. break를 만나서 종료
#     if not found:
#         print(f'{rental}은/는 보유하고 있지 않습니다.')
#         break
# else:
#     print('모든 도서가 대여 가능함')
